vex-rune/stm32/src/22_LoRa/Core/Inc/driver_llcc68_interface.h
/**
 * Copyright (c) 2015 - present LibDriver All rights reserved
 * 
 * The MIT License (MIT)
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
 * SOFTWARE. 
 *
 * @file      driver_llcc68_interface.h
 * @brief     driver llcc68 interface header file
 * @version   1.0.0
 * @author    Shifeng Li
 * @date      2023-04-15
 *
 * <h3>history</h3>
 * <table>
 * <tr><th>Date        <th>Version  <th>Author      <th>Description
 * <tr><td>2023/04/15  <td>1.0      <td>Shifeng Li  <td>first upload
 * </table>
 */

#ifndef DRIVER_LLCC68_INTERFACE_H
#define DRIVER_LLCC68_INTERFACE_H

#include "driver_llcc68.h"
#include "stm32f1xx_hal_gpio.h"
#include "main.h"

// CS 片选
#define CS_LOW HAL_GPIO_WritePin( lora_cs_GPIO_Port, lora_cs_Pin,GPIO_PIN_RESET);
#define CS_HIGH HAL_GPIO_WritePin( lora_cs_GPIO_Port, lora_cs_Pin,GPIO_PIN_SET);

// 复位
#define RST_LOW HAL_GPIO_WritePin( lora_rst_GPIO_Port, lora_rst_Pin,GPIO_PIN_RESET);
#define RST_HIGH HAL_GPIO_WritePin( lora_rst_GPIO_Port, lora_rst_Pin,GPIO_PIN_SET);

// 收发使能
#define RXEN_LOW HAL_GPIO_WritePin( lora_rxen_GPIO_Port, lora_rxen_Pin,GPIO_PIN_RESET);
#define RXEN_HIGH HAL_GPIO_WritePin( lora_rxen_GPIO_Port, lora_rxen_Pin,GPIO_PIN_SET);

#define TXEN_LOW HAL_GPIO_WritePin( lora_txen_GPIO_Port, lora_txen_Pin,GPIO_PIN_RESET);
#define TXEN_HIGH HAL_GPIO_WritePin( lora_txen_GPIO_Port, lora_txen_Pin,GPIO_PIN_SET);

// 读取BUSY
#define BUSY_READ HAL_GPIO_ReadPin( lora_busy_GPIO_Port, lora_busy_Pin);

#ifdef __cplusplus
extern "C" {



#endif

/**
 * @defgroup llcc68_interface_driver llcc68 interface driver function
 * @brief    llcc68 interface driver modules
 * @ingroup  llcc68_driver
 * @{
 */

/**
 * @brief  interface spi bus init
 * @return status code
 *         - 0 success
 *         - 1 spi init failed
 * @note   none
 */
uint8_t llcc68_interface_spi_init(void);

/**
 * @brief  interface spi bus deinit
 * @return status code
 *         - 0 success
 *         - 1 spi deinit failed
 * @note   none
 */
uint8_t llcc68_interface_spi_deinit(void);

/**
 * @brief      interface spi bus write read
 * @param[in]  *in_buf pointer to a input buffer
 * @param[in]  in_len input length
 * @param[out] *out_buf pointer to a output buffer
 * @param[in]  out_len output length
 * @return     status code
 *             - 0 success
 *             - 1 write read failed
 * @note       none
 */
uint8_t llcc68_interface_spi_write_read(uint8_t* in_buf, uint32_t in_len,
                                        uint8_t* out_buf, uint32_t out_len);

/**
 * @brief  interface reset gpio init
 * @return status code
 *         - 0 success
 *         - 1 init failed
 * @note   none
 */
uint8_t llcc68_interface_reset_gpio_init(void);

/**
 * @brief  interface reset gpio deinit
 * @return status code
 *         - 0 success
 *         - 1 deinit failed
 * @note   none
 */
uint8_t llcc68_interface_reset_gpio_deinit(void);

/**
 * @brief     interface reset gpio write
 * @param[in] data written data
 * @return    status code
 *            - 0 success
 *            - 1 write failed
 * @note      none
 */
uint8_t llcc68_interface_reset_gpio_write(uint8_t data);

/**
 * @brief  interface busy gpio init
 * @return status code
 *         - 0 success
 *         - 1 init failed
 * @note   none
 */
uint8_t llcc68_interface_busy_gpio_init(void);

/**
 * @brief  interface busy gpio deinit
 * @return status code
 *         - 0 success
 *         - 1 deinit failed
 * @note   none
 */
uint8_t llcc68_interface_busy_gpio_deinit(void);

/**
 * @brief      interface busy gpio read
 * @param[out] *value pointer to a value buffer
 * @return     status code
 *             - 0 success
 *             - 1 read failed
 * @note       none
 */
uint8_t llcc68_interface_busy_gpio_read(uint8_t* value);

/**
 * @brief     interface delay ms
 * @param[in] ms time
 * @note      none
 */
void llcc68_interface_delay_ms(uint32_t ms);

/**
 * @brief     interface print format data
 * @param[in] fmt format data
 * @note      none
 */
void llcc68_interface_debug_print(const char* const fmt, ...);

/**
 * @brief     interface receive callback
 * @param[in] type receive callback type
 * @param[in] *buf pointer to a buffer address
 * @param[in] len buffer length
 * @note      none
 */
void llcc68_interface_receive_callback(uint16_t type, uint8_t* buf, uint16_t len);

/**
 * @}
 */

#ifdef __cplusplus
}
#endif

#endif
